src/ExchangePlans/СОтборами/СОтборами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="e5d54824-bb20-438b-bcba-0f54ed4e383f">
  <name>СОтборами</name>
  <comment>Узел распределенной информационной базы с фильтром по подразделениям</comment>
  <attributes>
    <name>ИспользоватьОтборПоОрганизациям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОтборПоВидамЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьИнформативныеОстатки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Подразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыЦен</name>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнформативныеОстаткиПоСкладам</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

src/InformationRegisters/НастройкиАдресныхСкладов/НастройкиАдресныхСкладов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиАдресныхСкладов</name>
  <resources>
    <name>ГлубинаАнализа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МинимальнаяВероятностьОтгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УровеньОбслуживанияУпаковокКлассаX</name>
    <type>
      <types>EnumRef.УровниОбслуживания</types>
    </type>
  </resources>
  <resources>
    <name>УровеньОбслуживанияУпаковокКлассаY</name>
    <type>
      <types>EnumRef.УровниОбслуживания</types>
    </type>
  </resources>
  <resources>
    <name>УровеньОбслуживанияУпаковокКлассаZ</name>
    <type>
      <types>EnumRef.УровниОбслуживания</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьПодпитку</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РегламентноеЗаданиеРасчетаПоказателейПрогноза</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьАдресноеХранение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьАдресноеХранениеСправочно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьРабочиеУчастки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РегламентноеЗаданиеСозданиеЗаданийНаПодпитку</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>РегламентноеЗаданиеСозданиеЗаданийНаОтбор</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьРегламентноеЗаданиеСозданияЗаданийНаПодпитку</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьРегламентноеЗаданиеСозданияЗаданийНаОтбор</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НастройкаФормированияПоРабочимУчасткамОтбор</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ОграничиватьПоВесуОтбор</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОграничиватьПоОбъемуОтбор</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОграничениеПоОбъемуОтбор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОграничениеПоВесуОтбор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РабочийУчастокОтбор</name>
    <type>
      <types>CatalogRef.РабочиеУчастки</types>
    </type>
  </resources>
  <resources>
    <name>НастройкаФормированияПоРабочимУчасткамПодпитка</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ОграничиватьПоВесуПодпитка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОграничиватьПоОбъемуПодпитка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОграничениеПоВесуПодпитка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОграничениеПоОбъемуПодпитка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РабочийУчастокПодпитка</name>
    <type>
      <types>CatalogRef.РабочиеУчастки</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаАдресногоХраненияОстатков</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>РегламентныеЗаданияСозданияЗаданийНаПересчетТоваров</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/ExchangePlans/СОтборами/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем мДокументыКДопроведению;
Перем мЗаказыДляОтражения;
Перем мДанныеДляСозданияПерерасчетаСебестоимости;

Перем мКонтактыВзаимодействия;
Перем мПредментыВзаимодействия;
Перем мПапкиВзаимодействия;

Перем мПоставщикиЗаданийПартионногоУчета;
Перем мПоставщикиЗаданийВзаиморасчетовСКлиентами;
Перем мПоставщикиЗаданийВзаиморасчетовСПоставщиками;

#Область ОбработчикиСобытий

Процедура ПриПолученииДанныхОтПодчиненного(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад)
	
	Если ТипЗнч(ЭлементДанных) <> Тип("УдалениеОбъекта") Тогда
		
		Если Метаданные.Документы.Содержит(ЭлементДанных.Метаданные()) 
			И ОбменДаннымиУТУП.ОбъектНеПроходитФильтр(ЭлементДанных, Ссылка, Истина)
			И ЭлементДанных.Проведен Тогда
			мДокументыКДопроведению.Добавить(ЭлементДанных);
		КонецЕсли;
		
		Если мПоставщикиЗаданийПартионногоУчета[ЭлементДанных.Метаданные()] <> Неопределено Тогда
			мДанныеДляСозданияПерерасчетаСебестоимости.Добавить(ЭлементДанных);
		КонецЕсли;
		
		Если мПоставщикиЗаданийВзаиморасчетовСКлиентами.Найти(ТипЗнч(ЭлементДанных)) <> Неопределено
			Или мПоставщикиЗаданийВзаиморасчетовСПоставщиками.Найти(ТипЗнч(ЭлементДанных)) <> Неопределено Тогда
			
			ЭлементДанных.ДополнительныеСвойства.Вставить("ДляПроведения", Новый Структура("СтруктураВременныеТаблицы", 
				Новый Структура("МенеджерВременныхТаблиц", Новый МенеджерВременныхТаблиц)));
			ЭлементДанных.ДополнительныеСвойства.Вставить("ДатаРегистратора", КонецДня(ТекущаяДата()));
			ЭлементДанных.ДополнительныеСвойства.Вставить("РежимЗаписи",      РежимЗаписиДокумента.Запись);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПриПолученииДанныхФайла(ЭлементДанных);
	
КонецПроцедуры

Процедура ПриПолученииДанныхОтГлавного(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад)
	
	ПриПолученииДанныхФайла(ЭлементДанных);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ЭтотОбъект.Ссылка <> ПланыОбмена.СОтборами.ЭтотУзел() Тогда
		
		Если ОбменДаннымиПовтИспУТУП.ЭтоПодчиненныйУзелРИБСОтбором() Тогда
			
			ОбщиеДанныеУзлов = ОбменДаннымиПовтИсп.ОбщиеДанныеУзлов(ЭтотОбъект.Ссылка);
			НастройкиЦентальногоУзлаРИБ = ПланыОбмена.СОтборами.ЭтотУзел().ПолучитьОбъект();
			
			//Обновим данные подчиненного предопределнного узла РИБ с отборами если это необходимо
			Если ОбменДаннымиСобытия.ДанныеРазличаются(ЭтотОбъект, НастройкиЦентальногоУзлаРИБ, ОбщиеДанныеУзлов) Тогда
				ОбменДаннымиСобытия.ЗаполнитьЗначенияСвойствОбъекта(НастройкиЦентальногоУзлаРИБ, ЭтотОбъект, ОбщиеДанныеУзлов);
				НастройкиЦентальногоУзлаРИБ.Записать();
			КонецЕсли;
			
		КонецЕсли;
		
		Если ОбменДаннымиСервер.НадоВыполнитьОбработчикПослеЗагрузкиДанных(ЭтотОбъект, Ссылка) Тогда
			ПослеЗагрузкиДанных();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОтправкеДанныхГлавному(ЭлементДанных, ОтправкаЭлемента)
	
	Если ОтправкаЭлемента <> ОтправкаЭлементаДанных.Удалить 
		И ТипЗнч(ЭлементДанных) <> Тип("УдалениеОбъекта") Тогда
		
		ОбъектМетаданных = ЭлементДанных.Метаданные();
		
		Если ОбщегоНазначения.ЭтоРегистр(ОбъектМетаданных) Тогда
			
			ПереопределитьНаборЗаписей(ЭлементДанных, Ссылка);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОтправкеДанныхПодчиненному(ЭлементДанных, ОтправкаЭлемента, СозданиеНачальногоОбраза)
	
	Если ОтправкаЭлемента <> ОтправкаЭлементаДанных.Удалить 
		И ТипЗнч(ЭлементДанных) <> Тип("УдалениеОбъекта") Тогда
		
		ОбъектМетаданных = ЭлементДанных.Метаданные();
		
		Если ОбщегоНазначения.ЭтоРегистр(ОбъектМетаданных) Тогда
			
			ПереопределитьНаборЗаписей(ЭлементДанных, Ссылка);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Переопределяет стандартное поведение при загрузке данных;
//
Процедура ПриПолученииДанныхФайла(ЭлементДанных)
	
	ТипПолучаемогоОбъекта = ТипЗнч(ЭлементДанных);
	
	Если ТипПолучаемогоОбъекта = Тип("СправочникОбъект.СегментыНоменклатуры")
		Или ТипПолучаемогоОбъекта = Тип("СправочникОбъект.СегментыПартнеров")
		Или ТипПолучаемогоОбъекта = Тип("СправочникОбъект.ПравилаНачисленияИСписанияБонусныхБаллов")
		Или ТипПолучаемогоОбъекта = Тип("СправочникОбъект.ВидыОповещенийКлиентам") Тогда
		
		Если Не ЭлементДанных.ЭтоГруппа Тогда
			ЭлементДанных.РегламентноеЗадание = ПолучитьРеглЗаданияЭтойИБ( 
				ЭлементДанных, "РегламентноеЗадание");
		КонецЕсли;
		
	ИначеЕсли ТипПолучаемогоОбъекта = Тип("РегистрСведенийНаборЗаписей.НастройкиАдресныхСкладов") Тогда
		
		Запрос = Новый Запрос("
			|ВЫБРАТЬ
			|	НастройкиАдресныхСкладовНовая.Склад,
			|	НастройкиАдресныхСкладовНовая.Помещение,
			|	НастройкиАдресныхСкладовНовая.ГлубинаАнализа,
			|	НастройкиАдресныхСкладовНовая.МинимальнаяВероятностьОтгрузки,
			|	НастройкиАдресныхСкладовНовая.УровеньОбслуживанияУпаковокКлассаX,
			|	НастройкиАдресныхСкладовНовая.УровеньОбслуживанияУпаковокКлассаY,
			|	НастройкиАдресныхСкладовНовая.УровеньОбслуживанияУпаковокКлассаZ,
			|	НастройкиАдресныхСкладовНовая.ИспользоватьПодпитку,
			|	НастройкиАдресныхСкладовНовая.ИспользоватьАдресноеХранение,
			|	НастройкиАдресныхСкладовНовая.ИспользоватьАдресноеХранениеСправочно,
			|	НастройкиАдресныхСкладовНовая.ИспользоватьРабочиеУчастки,
			|	НастройкиАдресныхСкладовНовая.НастройкаФормированияПоРабочимУчасткамОтбор,
			|	НастройкиАдресныхСкладовНовая.ОграничиватьПоВесуОтбор,
			|	НастройкиАдресныхСкладовНовая.ОграничиватьПоОбъемуОтбор,
			|	НастройкиАдресныхСкладовНовая.ОграничениеПоОбъемуОтбор,
			|	НастройкиАдресныхСкладовНовая.ОграничениеПоВесуОтбор,
			|	НастройкиАдресныхСкладовНовая.РабочийУчастокОтбор,
			|	НастройкиАдресныхСкладовНовая.НастройкаФормированияПоРабочимУчасткамПодпитка,
			|	НастройкиАдресныхСкладовНовая.ОграничиватьПоВесуПодпитка,
			|	НастройкиАдресныхСкладовНовая.ОграничиватьПоОбъемуПодпитка,
			|	НастройкиАдресныхСкладовНовая.ОграничениеПоВесуПодпитка,
			|	НастройкиАдресныхСкладовНовая.ОграничениеПоОбъемуПодпитка,
			|	НастройкиАдресныхСкладовНовая.РабочийУчастокПодпитка
			|ПОМЕСТИТЬ ВТ_НовыйНаборЗаписей
			|ИЗ
			|	&ТаблицаНабораЗаписей КАК НастройкиАдресныхСкладовНовая
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_НовыйНаборЗаписей.Склад КАК Склад,
			|	ВТ_НовыйНаборЗаписей.Помещение КАК Помещение,
			|	ВТ_НовыйНаборЗаписей.ГлубинаАнализа,
			|	ВТ_НовыйНаборЗаписей.МинимальнаяВероятностьОтгрузки,
			|	ВТ_НовыйНаборЗаписей.УровеньОбслуживанияУпаковокКлассаX,
			|	ВТ_НовыйНаборЗаписей.УровеньОбслуживанияУпаковокКлассаY,
			|	ВТ_НовыйНаборЗаписей.УровеньОбслуживанияУпаковокКлассаZ,
			|	ВТ_НовыйНаборЗаписей.ИспользоватьПодпитку,
			|	ВТ_НовыйНаборЗаписей.ИспользоватьАдресноеХранение,
			|	ВТ_НовыйНаборЗаписей.ИспользоватьАдресноеХранениеСправочно,
			|	ВТ_НовыйНаборЗаписей.ИспользоватьРабочиеУчастки,
			|	ВТ_НовыйНаборЗаписей.НастройкаФормированияПоРабочимУчасткамОтбор,
			|	ВТ_НовыйНаборЗаписей.ОграничиватьПоВесуОтбор,
			|	ВТ_НовыйНаборЗаписей.ОграничиватьПоОбъемуОтбор,
			|	ВТ_НовыйНаборЗаписей.ОграничениеПоОбъемуОтбор,
			|	ВТ_НовыйНаборЗаписей.ОграничениеПоВесуОтбор,
			|	ВТ_НовыйНаборЗаписей.РабочийУчастокОтбор,
			|	ВТ_НовыйНаборЗаписей.НастройкаФормированияПоРабочимУчасткамПодпитка,
			|	ВТ_НовыйНаборЗаписей.ОграничиватьПоВесуПодпитка,
			|	ВТ_НовыйНаборЗаписей.ОграничиватьПоОбъемуПодпитка,
			|	ВТ_НовыйНаборЗаписей.ОграничениеПоВесуПодпитка,
			|	ВТ_НовыйНаборЗаписей.ОграничениеПоОбъемуПодпитка,
			|	ВТ_НовыйНаборЗаписей.РабочийУчастокПодпитка,
			|	ЕСТЬNULL(НастройкиАдресныхСкладов.РегламентноеЗаданиеРасчетаПоказателейПрогноза,       &ПустойИдентификатор) КАК РегламентноеЗаданиеРасчетаПоказателейПрогноза,
			|	ЕСТЬNULL(НастройкиАдресныхСкладов.РегламентноеЗаданиеСозданиеЗаданийНаПодпитку,        &ПустойИдентификатор) КАК РегламентноеЗаданиеСозданиеЗаданийНаПодпитку,
			|	ЕСТЬNULL(НастройкиАдресныхСкладов.РегламентноеЗаданиеСозданиеЗаданийНаОтбор,           &ПустойИдентификатор) КАК РегламентноеЗаданиеСозданиеЗаданийНаОтбор,
			|	ЕСТЬNULL(НастройкиАдресныхСкладов.РегламентныеЗаданияСозданияЗаданийНаПересчетТоваров, """") КАК РегламентныеЗаданияСозданияЗаданийНаПересчетТоваров,
			|	ВЫБОР
			|		КОГДА НастройкиАдресныхСкладов.РегламентноеЗаданиеСозданиеЗаданийНаПодпитку ЕСТЬ NULL 
			|			ТОГДА ЛОЖЬ
			|		ИНАЧЕ НастройкиАдресныхСкладов.ИспользоватьРегламентноеЗаданиеСозданияЗаданийНаПодпитку
			|	КОНЕЦ КАК ИспользоватьРегламентноеЗаданиеСозданияЗаданийНаПодпитку,
			|	ВЫБОР
			|		КОГДА НастройкиАдресныхСкладов.РегламентноеЗаданиеСозданиеЗаданийНаОтбор ЕСТЬ NULL 
			|			ТОГДА ЛОЖЬ
			|		ИНАЧЕ НастройкиАдресныхСкладов.ИспользоватьРегламентноеЗаданиеСозданияЗаданийНаОтбор
			|	КОНЕЦ КАК ИспользоватьРегламентноеЗаданиеСозданияЗаданийНаОтбор
			|ИЗ
			|	ВТ_НовыйНаборЗаписей КАК ВТ_НовыйНаборЗаписей
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиАдресныхСкладов КАК НастройкиАдресныхСкладов
			|		ПО ВТ_НовыйНаборЗаписей.Склад = НастройкиАдресныхСкладов.Склад
			|			И ВТ_НовыйНаборЗаписей.Помещение = НастройкиАдресныхСкладов.Помещение");
			
		Запрос.УстановитьПараметр("ТаблицаНабораЗаписей", ЭлементДанных.Выгрузить());
		Запрос.УстановитьПараметр("ПустойИдентификатор",  Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
		
		Результат = Запрос.Выполнить().Выгрузить();
		ЭлементДанных.Загрузить(Результат);
		
	ИначеЕсли ТипПолучаемогоОбъекта = Тип("РегистрСведенийНаборЗаписей.КонтактыВзаимодействий") Тогда
		
		КонтактВзаимодействия = ЭлементДанных.Отбор.Контакт.Значение;
		
		Если мКонтактыВзаимодействия.Найти(КонтактВзаимодействия) = Неопределено Тогда
			мКонтактыВзаимодействия.Добавить(КонтактВзаимодействия);
		КонецЕсли;
		
	ИначеЕсли ТипПолучаемогоОбъекта = Тип("РегистрСведенийНаборЗаписей.ПредметыПапкиВзаимодействий") Тогда
		
		мПредментыВзаимодействия = ОбменДаннымиУТУП.ОбъединитьМассивы(мПредментыВзаимодействия,ЭлементДанных.ВыгрузитьКолонку("Предмет"));
		мПапкиВзаимодействия     = ОбменДаннымиУТУП.ОбъединитьМассивы(мПапкиВзаимодействия,    ЭлементДанных.ВыгрузитьКолонку("ПапкаЭлектронногоПисьма"));
		
	ИначеЕсли ТипЗнч(ЭлементДанных) = Тип("ДокументОбъект.ЗаказКлиента")
		Или ТипЗнч(ЭлементДанных) = Тип("ДокументОбъект.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
		
		мЗаказыДляОтражения.Добавить(ЭлементДанных.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеЗагрузкиДанных()
	
	Справочники.КлючиАналитикиУчетаНоменклатуры.ЗаменитьДублиКлючейАналитики();
	Справочники.КлючиАналитикиУчетаПоПартнерам.ЗаменитьДублиКлючейАналитики();
	Справочники.КлючиАналитикиУчетаПартий.ЗаменитьДублиКлючейАналитики();
	Справочники.ВидыЗапасов.ЗаменитьДублиКлючейАналитики();
	Справочники.КлючиАналитикиУчетаНаборов.ЗаменитьДублиКлючейАналитики();
	
	Если мЗаказыДляОтражения.Количество() > 0 Тогда
		РегистрыСведений.СостоянияЗаказовКлиентов.ОтразитьСостояниеЗаказа(мЗаказыДляОтражения, Ложь, Ложь);
	КонецЕсли;
	
	Для Каждого ДанныеДляПерерасчета Из мДанныеДляСозданияПерерасчетаСебестоимости Цикл
		РасчетСебестоимости.ПриПолученииДанныхОтПодчиненного(ДанныеДляПерерасчета);
	КонецЦикла;
	
	//Расчет состояния контактов и очистка от дублей справочника СтроковыеКонтактыВзаимодействия
	Если мКонтактыВзаимодействия.Количество() > 0 Тогда
		
		Запрос = Новый Запрос("
			|ВЫБРАТЬ
			|	ОсновнойОбход.Ссылка КАК Ссылка,
			|	ПовторнаяВыборка.Ссылка КАК Дубль,
			|	ПовторнаяВыборка.ПометкаУдаления КАК ПометкаУдаления
			|ИЗ
			|	Справочник.СтроковыеКонтактыВзаимодействий КАК ОсновнойОбход
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтроковыеКонтактыВзаимодействий КАК ПовторнаяВыборка
			|		ПО ОсновнойОбход.Наименование = ПовторнаяВыборка.Наименование
			|			И (НЕ ОсновнойОбход.Ссылка = ПовторнаяВыборка.Ссылка)
			|ГДЕ
			|	НЕ ПовторнаяВыборка.Ссылка ЕСТЬ NULL 
			|	И ОсновнойОбход.Ссылка В(&МассивПолученных)
			|	И НЕ ОсновнойОбход.ПометкаУдаления
			|
			|СГРУППИРОВАТЬ ПО
			|	ОсновнойОбход.Ссылка,
			|	ПовторнаяВыборка.Ссылка");

		Запрос.УстановитьПараметр("МассивПолученных", мКонтактыВзаимодействия);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			// Сформируем соответствие ссылок и дублей.
			СоответствиеЗначений = Новый Соответствие;
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
			
				СоответствиеЗначений.Вставить(Выборка.Дубль, Выборка.Ссылка);
				
				Если Не Выборка.ПометкаУдаления Тогда
					СправочникОбъект = Выборка.Дубль.ПолучитьОбъект();
					Попытка
						СправочникОбъект.УстановитьПометкуУдаления(Истина, Ложь);
					Исключение
					КонецПопытки;
				КонецЕсли;
				
			КонецЦикла;
			
			ОбщегоНазначенияУТ.ЗаменитьСсылки(СоответствиеЗначений);
		
		КонецЕсли;
		
		//Расчет состояния контактов
		Взаимодействия.РассчитатьРассмотреноПоКонтактам(Взаимодействия.ТаблицаДанныхДляРасчетаРассмотрено(мКонтактыВзаимодействия, "Контакт"));
		
	КонецЕсли;
	
	//Расчет состояние предметов взаимодействия
	Если мПредментыВзаимодействия.Количество() > 0 Тогда
		Взаимодействия.РассчитатьРассмотреноПоПредметам(Взаимодействия.ТаблицаДанныхДляРасчетаРассмотрено(мПредментыВзаимодействия, "Предмет"));
	КонецЕсли;
	
	//Расчет состояния папок взаимодействия
	Если мПапкиВзаимодействия.Количество() > 0 Тогда
		Взаимодействия.РассчитатьРассмотреноПоПапкам(Взаимодействия.ТаблицаДанныхДляРасчетаРассмотрено(мПапкиВзаимодействия, "Папка"));
	КонецЕсли;
	
	Для Каждого ДокументОбъект Из мДокументыКДопроведению Цикл
		
		ДокументСсылка = ДокументОбъект.Ссылка;
		
		Если ЗначениеЗаполнено(ДокументСсылка)
			И ОбщегоНазначения.СсылкаСуществует(ДокументСсылка) Тогда
			
			Если ОбменДаннымиУТУП.ОбъектНеПроходитФильтр(ДокументОбъект, Ссылка, Истина) Тогда
				ДокументОбъект.ОбменДанными.Загрузка = Ложь;
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьРеглЗаданияЭтойИБ(ЭлементДанных, ИмяРеквизита)
	
	Если Не ОбщегоНазначения.СсылкаСуществует(ЭлементДанных.Ссылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РеглЗаданияЭтойИБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		ЭлементДанных.Ссылка, ИмяРеквизита);
		
	Если Не ЗначениеЗаполнено(РеглЗаданияЭтойИБ)
		Или РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РеглЗаданияЭтойИБ) = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат РеглЗаданияЭтойИБ;
	КонецЕсли;
	
КонецФункции

Процедура ПереопределитьНаборЗаписей(ЭлементДанных, УзелПланаОбмена)
	
	КоличествоЗаписейВНаборе = ЭлементДанных.Количество() - 1;
	
	Пока КоличествоЗаписейВНаборе >= 0 Цикл
		
		ЗаписьНабора = ЭлементДанных[КоличествоЗаписейВНаборе];
		
		Если ОбменДаннымиУТУП.ОбъектНеПроходитФильтр(ЗаписьНабора, УзелПланаОбмена) Тогда
			ЭлементДанных.Удалить(ЗаписьНабора);
		КонецЕсли;
		
		КоличествоЗаписейВНаборе = КоличествоЗаписейВНаборе - 1;
		
	КонецЦикла;
	
КонецПроцедуры

мДокументыКДопроведению                       = Новый Массив;
мДанныеДляСозданияПерерасчетаСебестоимости    = Новый Массив;
мПоставщикиЗаданийПартионногоУчета            = РасчетСебестоимости.ВходящиеДанныеМеханизма(Истина);
мПоставщикиЗаданийВзаиморасчетовСКлиентами    = ОбменДаннымиУТУП.РегистрыДляСозданияЗаданийКРасчетуВзаиморасчетовСКлиентами();
мПоставщикиЗаданийВзаиморасчетовСПоставщиками = ОбменДаннымиУТУП.РегистрыДляСозданияЗаданийКРасчетуВзаиморасчетовСПоставщиками();
мЗаказыДляОтражения                           = Новый Массив;

мКонтактыВзаимодействия               = Новый Массив;
мПредментыВзаимодействия              = Новый Массив;
мПапкиВзаимодействия                  = Новый Массив;

#КонецОбласти

#КонецЕсли
